# Задача 32: Определить индексы элементов
# массива (списка), значения которых
# принадлежат заданному диапазону (т.е.
# не меньше заданного минимума и не больше заданного максимума)
# Ввод: [-5, 9, 0, 3, -1, -2, 1, 4,-2,10,2,0,-9,8,10,-9, 0, -5, -5, 7]
# Вывод: [1, 9, 13, 14, 19]

m = [-5, 9, 0, 3, -1, -2, 1, 4, -2, 10, 2, 0, -9, 8, 10, -9, 0, -5, -5, 7]
n = []

def rev(a,b):
    for i in range(0,len(m)):
        if (m[i] >= a) and (m[i] <= b):
            n.append(i)
    return print(n)
    
rev(7,15)